//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"BUILDING_ENTITY_STORE"="Wykonywanie kroku %d z %d: Tworzenie magazynu jednostek";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_BOOTSTRAP_DATABASE"="Wykonywanie kroku %d z %d: Tworzenie bazy danych inicjowania";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_REQUEST_QUEUE_DATABASE"="Wykonywanie kroku %d z %d: Tworzenie bazy danych kolejki zapytań";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - received bytes; 2nd %s - total bytes.
"DOWNLOADING_ENTITY_STORE"="Wykonywanie kroku %d z %d: Pobieranie magazynu jednostek. Na razie odebrano %s z %s’.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ERASING_EXPIRED_REQUESTS"="Wykonywanie kroku %d z %d: Usuwanie wygasłych zapytań";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"LOADING_METADATA"="Wykonywanie kroku %d z %d: Wczytywanie metadanych";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_REQUEST_QUEUE_MERGE"="Wykonywanie kroku %d z %d: Wykonywanie łączenia kolejki zapytań";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_TRANSACTION_MERGE"="Wykonywanie kroku %d z %d: Wykonywanie łączenia transakcji";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_CREATE_DELETE_MERGE"="Wykonywanie kroku %d z %d: Wykonywanie łączenia tworzenia i usuwania";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request name; 2nd %s - request url.
"PROCESSING_DEFINING_QUERIES"="Wykonywanie kroku %d z %d: Przetwarzanie definiowania zapytań ‘%s za pomocą %s’";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request number; 2nd %s - total request number.
"PROCESSING_REQUESTS"="Wykonywanie kroku %d z %d: Przetwarzanie zapytań. Wysyłanie prośby o modyfikację %s z %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REAPPLYING_CHANGES"="Wykonywanie kroku %d z %d: Ponowne zastosowanie zmian";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ANALYZING_RECEIVED_DATA"="Wykonywanie kroku %d z %d: Analiza otrzymanych danych";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - received bytes.
"RECEIVING_DATA_FROM_SERVER"="Wykonywanie kroku %d z %d: Odbieranie danych z serwera. Do tej pory odebrano %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REMOVING_DELETED_RELATIONSHIPS"="Wykonywanie kroku %d z %d: Usuwanie usuniętych relacji";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. Removing requests that have a custom http header "REMOVE_AFTER_UPLOAD". Note: the header name is a constant, please do not translate.
"REMOVING_REMOVEAFTERUPLOAD_REQUESTS"="Wykonywanie kroku %d z %d: Usuwanie zapytań oznaczonych jako: Usuń po przesłaniu";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - sent bytes.
"SENDING_DATA_TO_SERVER"="Wykonywanie kroku %d z %d: Wysyłanie danych na serwer. Do tej pory wysłano %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_ENTITY_STORE_DATABASE"="Wykonywanie kroku %d z %d: Wysyłanie bazy danych magazynu jednostek. Do tej pory wysłano %s z %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_REQUEST_QUEUE_DATABASE"="Wykonywanie kroku %d z %d: Wysyłanie bazy danych kolejki zapytań. Do tej pory wysłano %s z %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"STARTING_COMMUNICATION_WITH_SERVER"="Wykonywanie kroku %d z %d: Rozpoczęcie komunikacji z serwerem";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"UPLOAD_PREPROCESSING"="Wykonywanie kroku %d z %d: Wstępne przetwarzanie zapytań przed przesłaniem";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"WAITING_FOR_DOWNLOAD"="Wykonywanie kroku %d z %d: Oczekiwanie na pobranie";

